app/controllers/spree/admin/line_item_option_types_controller.rb

      def create
        invoke_callbacks(:create, :before)
        @object.attributes = permitted_resource_params
        if @object.save
          invoke_callbacks(:create, :after)
          flash[:success] = flash_message_for(@object, :successfully_created)

          # if input_type is != 'selection', create default liov
          # TODO: handle errors
          unless @object.selection?
            @object.line_item_option_values.create(name: @object.input_type, presentation: @object.input_type)
---
INSERT INTO "spree_line_item_option_values" ("name", "presentation", "line_item_option_type_id", "created_at", "updated_at", "position") VALUES (?, ?, ?, ?, ?, ?)  [["name", "text"], ["presentation", "text"], ["line_item_option_type_id", 2], ["created_at", "2017-12-17 16:42:55.497800"], ["updated_at", "2017-12-17 16:42:55.497800"], ["position", 1]]

        def set_available_line_item_option_types
          @available_line_item_option_types = if @product.line_item_option_type_ids.any?
---
SELECT  "spree_line_item_option_types".* FROM "spree_line_item_option_types" WHERE (spree_line_item_option_types.position IS NOT NULL) AND (1 = 1)  ORDER BY spree_line_item_option_types.position DESC LIMIT 1
SELECT COUNT(*) FROM "spree_line_item_option_types"